#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`
<details><summary>Show Plan</summary>

```

module.ecr.data.aws_ecr_lifecycle_policy_document.il101_ecr_default_policy: Reading...
module.ecr.aws_ecr_repository.il01_analyzer: Refreshing state... [id=il01/analyzer]
module.ecr.aws_ecr_repository.il01_harvester: Refreshing state... [id=il01/harvester]
module.ecr.aws_ecr_lifecycle_policy.il01_api_server_lifecycle_policy: Refreshing state... [id=il01/api_server]
module.ecr.aws_ecr_repository.il01_api_server: Refreshing state... [id=il01/api_server]
module.ecr.data.aws_ecr_lifecycle_policy_document.il101_ecr_default_policy: Read complete after 0s
module.ecr.aws_ecr_lifecycle_policy.il01_analyzer_lifecycle_policy: Refreshing state... [id=il01/analyzer]
module.ecr.aws_ecr_lifecycle_policy.il01_harvester_lifecycle_policy: Refreshing state... [id=il01/harvester]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.ecr.aws_ecr_lifecycle_policy.il01_api_lifecycle_policy will be created
  + resource "aws_ecr_lifecycle_policy" "il01_api_lifecycle_policy" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "This is the default policy. It will persist at most 5 tags."
                      + rulePriority = 1
                      + selection    = {
                          + countNumber    = 5
                          + countType      = "imageCountMoreThan"
                          + tagPatternList = [
                              + "*",
                            ]
                          + tagStatus      = "tagged"
                        }
                    },
                ]
            }
        )
      + registry_id = (known after apply)
      + repository  = "il01/api"
    }

  # module.ecr.aws_ecr_lifecycle_policy.il01_api_server_lifecycle_policy will be destroyed
  # (because aws_ecr_lifecycle_policy.il01_api_server_lifecycle_policy is not in configuration)
  - resource "aws_ecr_lifecycle_policy" "il01_api_server_lifecycle_policy" {
      - id          = "il01/api_server" -> null
      - policy      = jsonencode(
            {
              - rules = [
                  - {
                      - action       = {
                          - type = "expire"
                        }
                      - description  = "This is the default policy. It will persist at most 5 tags."
                      - rulePriority = 1
                      - selection    = {
                          - countNumber    = 5
                          - countType      = "imageCountMoreThan"
                          - tagPatternList = [
                              - "*",
                            ]
                          - tagStatus      = "tagged"
                        }
                    },
                ]
            }
        ) -> null
      - registry_id = "043309351324" -> null
      - repository  = "il01/api_server" -> null
    }

  # module.ecr.aws_ecr_repository.il01_api will be created
  + resource "aws_ecr_repository" "il01_api" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "il01/api"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr.aws_ecr_repository.il01_api_server will be destroyed
  # (because aws_ecr_repository.il01_api_server is not in configuration)
  - resource "aws_ecr_repository" "il01_api_server" {
      - arn                  = "arn:aws:ecr:us-east-2:043309351324:repository/il01/api_server" -> null
      - id                   = "il01/api_server" -> null
      - image_tag_mutability = "MUTABLE" -> null
      - name                 = "il01/api_server" -> null
      - registry_id          = "043309351324" -> null
      - repository_url       = "043309351324.dkr.ecr.us-east-2.amazonaws.com/il01/api_server" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

      - image_scanning_configuration {
          - scan_on_push = true -> null
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + il01_api_repository_url        = (known after apply)
  - il01_api_server_repository_url = "043309351324.dkr.ecr.us-east-2.amazonaws.com/il01/api_server" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Action: `pull_request`*